{"pageProps":{"data":{"name":"Capital Management Workshop","underDomain":"workshops","icon":"/Workshops/stocks-white.png","image":"/Workshops/capital-management.jpg","contactPhone":"+91 9789002028","location":"CEG, Anna University, Chennai","registrationUrl":"https://unstop.com/workshop/capital-management-workshop-enantra-entrepreneurship-mantra-anna-university-au-chennai-499202","contactEmail":"vdhanya03@gmail.com","date":"02 Dec 22, 10:00 AM to 12:00 PM IST","oneLineDescription":"Capital management is shortly defined as “a financial strategy aimed at ensuring maximum efficiency in a company's cash flow. ","multiLineDescription":"Capital management is shortly defined as “a financial strategy aimed at ensuring maximum efficiency in a company's cash flow. “Capital management is a mystery to the vast majority of people. While most understand that money flows through global economies, few grasp the intricacies of putting that capital to work for a company. Thus, many struggles to grasp just what capital management is. An entrepreneur is a term which is used to denote the person who runs or owns two or more businesses. For beginners pursuing business, capital management is much more important because they need to know about the flow of money in the market so they would handle the critical situation whenever the company gets low.\n        \n        Those people should know which is an “asset” and which is a “liability”. Adding a note on the asset, this is the value which will generate income. Assets include buying land, renting a house, starting a business etc. Liability is a term in which the value of the things gets depreciated after buying them. Liability includes buying a car, bike, home etc. the asset is like a long-term investment but the liability is where the money gets exchanged for things, but the thing's value gets low after using it or owning it. Only mathematics is not used to manage money beyond that there are a lot of things hidden in it. \n       \n       Efficient capital management helps ensure your business runs smoothly and includes managing your inventory, accounts receivables, and accounts payables. It also takes maintaining both your short-term assets and liabilities to ensure you have the liquid funds necessary to run your day-to-day operations. \n       \n       The importance of finance in business cannot be sufficiently stressed. Business finance can help entrepreneurs purchase land, capital assets and other assets without much difficulty and can focus solely on commencing the operations of the business. To make sure the next generation of entrepreneurs understands the importance of capital management, AUSEC presents a 2-hour workshop on capital management conducted by Mr Balaji Premkumar, co-founder of the company exemplary.ai. He is the managing director of the law firm, Tanvi Balaji and associates and is the co-founder and former COO of Business Sources inc. The workshop will focus on understanding and identifying areas where one should spend and save money and make wise choices that will provide your startup with a solid financial backbone.\n       Name: Dhanya Venkateswaran\n       "}},"__N_SSG":true}