{"pageProps":{"data":{"name":"Writing and Stories A Guided Adventure","underDomain":"workshops","icon":"/EnantraWebsite/Workshops/writing-stories-white.png","image":"/EnantraWebsite/Workshops/writing-stories.jpg","contactPhone":"7200822605","location":"CEG, Anna University, Chennai","registrationUrl":"https://unstop.com/p/writing-and-stories-a-guided-adventure-enantra-entrepreneurship-mantra-anna-university-au-chennai-494715","contactEmail":"","date":"02 Dec 22, 01:30 to 03:30 PM IST","oneLineDescription":"The ability to share information, convince people and help them through writing is amazing.","multiLineDescription":"The ability to share information, convince people and help them through writing is amazing. Content writing in the business allows customers to learn about services and products, compare companies, and find relevant information. Nowadays, business writing includes blogs, articles, SlideShare content, etc.\n\n        Good-quality content allows customers to learn about a particular company, understand what services and products it offers, why a particular company is better than its competitors, etc. There are many business writers in demand since the amount of information that needs to be put in words and presented on websites is huge.\n        \n        Writers had to come up with ideas, do research, and then put their thoughts into words. However, nowadays, content writing has become easier, thanks to a number of AI writing software programs. These programs can help you to come up with ideas, do research, and even write entire articles on your behalf. As a result, you can save a lot of time and effort when it comes to creating content.\n        \n        Writing ability is the most important in business. Students of colleges and universities must know how to write a business essay since most jobs require good writing skills and at least some knowledge of how business works. If you are in the middle of writing a good essay on business but find it difficult, finding a reliable writing service will save you time.\n        \n        Content is the new marketing currency for businesses. It can help solidify the character and reputation of the brand, it provides value to incoming customers, it attracts new customers who are looking for information, and it increases search visibility. Businesses with a successful content marketing strategy tend to be successful in their other online marketing efforts, since building an impactful online reputation requires multiple channels in sync with one another.\n        \n        From print to digital, writing has always played an important role in marketing the product. Content writing is one of the modern world's growing business sectors. With very less to zero investments, content/creative writing is becoming a full-fledged career option for many. From blogs, social media marketing, story writing, and so on, writers have become efficient entrepreneurs by making an impact in society with their content and also having financial stability. Hence, the content writing workshop is planned as an entrepreneurship skill development.\n        \n        Do you want to become a content creator? A novelist? A blogger? A speaker? That is brilliant!\n        \n        In the journey to become who you want to be from the above, the first step is, well, to write. The straightforward action of writing, putting pen to paper, typing words on your laptop. To back this action of writing, we need the desire to share a story, express what was felt, and draw in words to express what conspired. This workshop by The Folded Paper Writing will help you get started in that journey of writing and storytelling. The simplest way to fall in love with writing is to experience first hand The Folded paper Writing's tried and tested activities that make the process of writing joyous, exciting, and adventurous.\n        \n        Are you ready for an adventure to see writing and the writer in you in a new light?\n        \n        Note: Reporting time - 1.30 pm IST\n        \n        Facilitator Details: Ms.Harini and Ms.Shibani, writers and co-creators, The Folded Paper Writing Community.\n        \n        POC Details:\n        \n        Krithika Priya M-7200822605\n        Sudharshan Kailash-9150269389        \n        "}},"__N_SSG":true}